[
  {
    "page_content": "This document provides contact information (address, phone, email, website) for the École Supérieure d’Ingénieurs de Beyrouth (ESIB), the Faculty of Engineering at Université Saint-Joseph de Beyrouth.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Address and Contact",
      "chunk_index": 0
    }
  },
  {
    "page_content": "This document details the history of the **École Supérieure d’Ingénieurs de Beyrouth (ESIB)**, a pioneering engineering school in the Middle East. Founded in 1913 as **École Française d'ingénieurs de Beyrouth (EFIB)**, modeled after the École Centrale de Lyon, it initially focused on general engineering, evolving to include architecture and other specializations. After closures due to war and conflict, ESIB adapted to changing needs, modernizing its curriculum, expanding programs, and establishing partnerships with French institutions. It transitioned to the ECTS system, introduced English-taught programs, and continues to expand its offerings in engineering and technology, including programs in data science, artificial intelligence, and various engineering disciplines.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Historique",
      "chunk_index": 1
    }
  },
  {
    "page_content": "ESIB (École Supérieure d’Ingénieurs de Beyrouth) provides a strong Francophone engineering education, focusing on scientific and technical knowledge, along with skills like creativity and cooperation, to prepare students for diverse engineering careers.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Mission de l’ESIB",
      "chunk_index": 2
    }
  },
  {
    "page_content": "ESIB's vision is to be a leading engineering school focused on high-level education, research, employment preparation, intercultural dialogue, and holistic student development.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Vision de l’ESIB",
      "chunk_index": 3
    }
  },
  {
    "page_content": "This document outlines the leadership of the École Supérieure d’Ingénieurs de Beyrouth (ESIB), listing key personnel like the Doyen and directors of its academic departments and research centers.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Direction",
      "chunk_index": 4
    }
  },
  {
    "page_content": "This document details the administrative staff at École Supérieure d’Ingénieurs de Beyrouth (ESIB), covering various departments and research centers.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Administration",
      "chunk_index": 5
    }
  },
  {
    "page_content": "This document is a list of 66 faculty members (Professors, Lecturers, etc.) at the École Supérieure d’Ingénieurs de Beyrouth (ESIB), categorized by title.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Corps Professoral",
      "chunk_index": 6
    }
  },
  {
    "page_content": "ESIB offers engineering degrees (Diplôme d'Ingénieur) in various fields like chemical, civil, electrical, computer, and mechanical engineering, as well as Master's degrees in areas including data science, renewable energies, and artificial intelligence.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Diplômes",
      "chunk_index": 7
    }
  },
  {
    "page_content": "This document details admission requirements for the École Supérieure d’Ingénieurs de Beyrouth (ESIB), including undergraduate and various Master's programs. Admission to undergraduate programs requires a Lebanese scientific Baccalaureate or equivalent, along with language proficiency in French or English. Master's programs have specific requirements based on the field of study, typically requiring relevant Bachelor's or Master's degrees. Application deadlines and processes vary depending on the program and semester.It also include entrance conditions and acceptance to the university.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Admission",
      "chunk_index": 8
    }
  },
  {
    "page_content": "ESIB tuition fees are paid in two installments per semester. In 2022-2023, it was $268 per credit for preparatory and engineering programs, totaling $8040 for 30 credits. 20% is paid in USD, 80% in Lebanese pounds (at 6000LL/USD). Financial aid is available.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Frais de scolarité",
      "chunk_index": 9
    }
  },
  {
    "page_content": "ESIB's engineering program at the École Supérieure d’Ingénieurs de Beyrouth (ESIB) requires two years of preparatory classes (120 credits) followed by three years of specialized study (180 credits) in Electrical/Mechanical, Chemical/Petrochemical, or Civil/Environmental Engineering, leading to an engineering degree.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Organisation des enseignements",
      "chunk_index": 10
    }
  },
  {
    "page_content": "ESIB fosters a welcoming student life (\"Vie associative\") through active student associations that organize activities, address issues, and build lasting alumni connections.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Vie associative",
      "chunk_index": 11
    }
  },
  {
    "page_content": "The Aumônerie at ESIB (École Supérieure d’Ingénieurs de Beyrouth) is a Christian-based organization welcoming all students. It offers a space for spiritual growth and reflection, including a campus chapel.",
    "metadata": {
      "Header 1": "École Supérieure d’Ingénieurs de Beyrouth (ESIB)",
      "Header 2": "Aumônerie",
      "chunk_index": 12
    }
  },
  {
    "page_content": "This document lists the faculty of the **Corps Professoral** within the **Département des Classes Préparatoires**, including Professors, Associate Professors, Lecturers, and Course Instructors.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Corps Professoral",
      "chunk_index": 13
    }
  },
  {
    "page_content": "The document outlines the objectives of the preparatory classes department, focusing on teaching students core scientific concepts for future specialized studies.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Objectifs",
      "chunk_index": 14
    }
  },
  {
    "page_content": "This document outlines the career paths (Débouchés) available to students after completing two years of study in the \"Département des Classes Préparatoires.\" Graduates can pursue further studies, earning 180 ECTS credits, in engineering departments like Chemical & Petrochemical Engineering, Civil & Environmental Engineering, or Electrical & Mechanical Engineering.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Débouchés",
      "chunk_index": 15
    }
  },
  {
    "page_content": "The **Département des Classes Préparatoires** offers eight programs (120 ECTS each) to prepare students for French \"Grandes Ecoles\" and/or specific engineering departments. These programs cover areas like Chemical, Civil, Electrical, Computer, and Mechanical Engineering, including dedicated exam preparation courses.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programmes et Formations",
      "chunk_index": 16
    }
  },
  {
    "page_content": "This document details the **Programme Préparatoire Génie Chimique et Pétrochimique** at the USJ's preparatory department. The program aims to develop well-rounded engineers with strong technical skills, ethical awareness, and leadership potential. The curriculum, totaling 114 ECTS credits, includes required courses in English, general culture, and fundamental sciences (mathematics and physics/chemistry), along with elective options. The program's first four semesters provide a structured foundation in mathematics, physics, chemistry, and introductory engineering concepts, progressing to more specialized topics like thermodynamics, fluid mechanics, and computer-aided design.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Préparatoire Génie Chimique et Pétrochimique",
      "chunk_index": 17
    }
  },
  {
    "page_content": "This document details the **Programme Préparatoire Génie Civil** (Civil Engineering Preparatory Program) offered by the **Département des Classes Préparatoires**. The program aims to prepare students for leadership roles in a global, professional environment through trilingual skills, continuous learning, and key engineering competencies. The curriculum, spanning four semesters, includes required courses (114 ECTS), general culture courses (12 ECTS), and fundamental courses (84 ECTS) covering mathematics, sciences, and introductory engineering topics like mechanics, physics, computer science, and design. Each semester's course load and credit hours are specified.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Préparatoire Génie Civil",
      "chunk_index": 18
    }
  },
  {
    "page_content": "This document details the curriculum for the **Programme Préparatoire Génie Électrique** at USJ, designed to prepare students for careers and advanced studies in electrical engineering. The program emphasizes key engineering competencies and includes required courses in English and general culture, along with closed and open electives. The core curriculum comprises fundamental courses in mathematics and sciences, covering topics like analysis, linear algebra, electromagnetism, mechanics, and computer science. The four-semester structure progresses from foundational subjects to advanced electrical engineering concepts, culminating in a project.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Préparatoire Génie Électrique",
      "chunk_index": 19
    }
  },
  {
    "page_content": "This document details the **Programme Préparatoire Génie Informatique et Communications**, a preparatory engineering program at the **Département des Classes Préparatoires**. The program aims to prepare students for advanced studies and leadership roles in the field. The curriculum, totaling 114 ECTS credits in mandatory units, covers key engineering competencies like problem-solving, design, communication, and teamwork. It includes English proficiency, general culture courses, and fundamental units in mathematics and sciences (physics and computer science). The program structure, spanning four semesters, outlines specific courses in math, physics, computer science, and engineering fundamentals, along with elective options and lab work.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Préparatoire Génie Informatique et Communications",
      "chunk_index": 20
    }
  },
  {
    "page_content": "This document details the curriculum for the **Programme Préparatoire Génie Mécanique** at the **Département des Classes Préparatoires**. The program aims to prepare students for careers and advanced studies in mechanical engineering by developing key competencies like problem-solving, design, communication, and teamwork. The four-semester program includes required courses (114 ECTS), closed and open electives (6 ECTS total), and fundamental courses in mathematics (46 ECTS) and sciences (36 ECTS). The curriculum covers a range of topics, including mechanics, thermodynamics, computer science (MATLAB), and specialized engineering areas like industrial design and electrical systems.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Préparatoire Génie Mécanique",
      "chunk_index": 21
    }
  },
  {
    "page_content": "This document details the **Programme Concours Génie Chimique et Pétrochimique**, a 120-ECTS credit program offered by the Département des Classes Préparatoires. It aims to prepare students for leadership roles in chemical and petrochemical engineering through a curriculum emphasizing problem-solving, design, communication, ethics, teamwork, and continuous learning. The program includes mandatory courses in English, General Culture, Mathematics, Sciences (Chemistry, Physics, Mechanics), and Computer Science, alongside specialized courses and a personal initiative project. The four-semester program covers a wide range of subjects including advanced mathematics, physics, chemistry, and engineering fundamentals.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Concours Génie Chimique et Pétrochimique",
      "chunk_index": 22
    }
  },
  {
    "page_content": "This document details the **Programme Concours Génie Civil**, a four-semester engineering program offered by the **Département des Classes Préparatoires**. The program aims to develop future engineering leaders with strong technical skills, trilingual abilities, and ethical awareness. The curriculum, totaling 120 ECTS credits, focuses on core engineering competencies through mandatory courses in English, general culture, mathematics, sciences (physics, chemistry), and computer science, culminating in specialized courses in engineering fundamentals. The program emphasizes practical application and continuous learning.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Concours Génie Civil",
      "chunk_index": 23
    }
  },
  {
    "page_content": "This document details the **Programme Concours Génie Électrique** offered by the **Département des Classes Préparatoires**, designed to prepare students for engineering careers and advanced studies. The program emphasizes key engineering skills and comprises 120 ECTS credits across four semesters. Core coursework includes English, General Culture, Fundamental Courses (Mathematics and Sciences), Computer Science, and Specialized Courses. The curriculum covers a broad range of subjects including mathematics, physics, chemistry, computer science, and engineering fundamentals, with practical lab work and project-based learning integrated throughout.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Concours Génie Électrique",
      "chunk_index": 24
    }
  },
  {
    "page_content": "This document details the **Programme Concours Génie Informatique et Communications**, a four-semester engineering program offered by the Département des Classes Préparatoires. The program aims to prepare students for leadership roles and advanced studies. The curriculum, totaling 120 ECTS credits, emphasizes core engineering competencies and includes courses in English, general culture, mathematics, sciences (physics, chemistry), and computer science. It also features specialized units and a personal initiative project, with a structured course load across the four semesters.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Concours Génie Informatique et Communications",
      "chunk_index": 25
    }
  },
  {
    "page_content": "The **Département des Classes Préparatoires** offers a **Programme Concours Génie Mécanique** designed to prepare students for engineering careers and advanced studies. The program emphasizes key engineering skills like problem-solving, design, communication, and ethical responsibility. The 120 ECTS credit curriculum includes English, general culture, and fundamental courses in mathematics and sciences, with a strong focus on computer science and specialized engineering topics. The document details the course structure across the first four semesters, outlining specific courses and credit values.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Programme Concours Génie Mécanique",
      "chunk_index": 26
    }
  },
  {
    "page_content": "This document presents detailed descriptions of foundational courses offered in the Département des Classes Préparatoires at ESIB. The curriculum spans core disciplines such as mathematics, physics, and chemistry, and aims to build rigorous analytical and scientific foundations for engineering students.It has course descriptions/content for each course in the department including number of credits and prerequistes.",
    "metadata": {
      "Header 1": "Département des Classes Préparatoires",
      "Header 2": "Descriptives des Cours",
      "chunk_index": 27
    }
  },
  {
    "page_content": "This document lists the teaching staff (Professors, Associate Professors, Lecturers, and Teaching Assistants) of the Electrical and Mechanical Engineering Department.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Corps Professoral",
      "chunk_index": 28
    }
  },
  {
    "page_content": "The Department of Electrical and Mechanical Engineering at the Beirut Engineering School aims to foster student learning through teaching, advising, and study coordination, aligning with the Faculty of Engineering's pedagogical goals.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Objectifs",
      "chunk_index": 29
    }
  },
  {
    "page_content": "Graduates of the Electrical and Mechanical Engineering program have excellent career prospects, quickly finding stable employment in diverse sectors like industry, construction, IT, and business, with good opportunities for advancement.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Débouchés",
      "chunk_index": 30
    }
  },
  {
    "page_content": "This document outlines further education and research opportunities within the Electrical and Mechanical Engineering Department. Graduates can pursue Master's or Doctoral studies, including joint doctoral programs with other universities.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Spécialisation et Recherche",
      "chunk_index": 31
    }
  },
  {
    "page_content": "Students in the **Département Génie Électrique et Mécanique** can earn an engineering diploma after completing preparatory classes, accumulating 120 credits, and then choosing one of three programs: **Génie Électrique, Génie Informatique et Communications (with software and telecom options), or Génie Mécanique**. These programs require an additional 180 credits.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Programmes et Options",
      "chunk_index": 32
    }
  },
  {
    "page_content": "It includes information related to total program credits and types,objective , proposed plan .This document details the Electrical Engineering program within the Electrical and Mechanical Engineering Department. The program aims to prepare students for successful careers and advanced studies by developing key engineering competencies. It outlines a curriculum requiring 150 mandatory, 26 closed elective, and 4 open elective credits, covering core electrical engineering principles and advanced topics. The program includes practical experience through internships (4-week recommended, 6-10 week mandatory), a multidisciplinary project, and a final year project. The course structure is presented across five semesters, with Semester 5 and 6 specifically detailed, highlighting core courses, electives, and the final project.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Programme Génie Électrique",
      "chunk_index": 33
    }
  },
  {
    "page_content": "This document details the curriculum for the Computer Engineering and Communications program within the Department of Electrical and Mechanical Engineering. The program aims to prepare students for global careers and advanced studies by focusing on core engineering competencies and a comprehensive curriculum. The 180-credit program includes mandatory and elective courses covering computer architecture, software engineering, data science, networking, and specialized topics. The program includes a core curriculum, internships, and a final year project. The curriculum is structured across four semesters, with a focus on foundational knowledge in the first two semesters, followed by specialization tracks in Software Engineering and Telecommunications Networks, and culminating in a final project.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Programme Génie Informatique et Communications",
      "chunk_index": 34
    }
  },
  {
    "page_content": "This document details the Mechanical Engineering program (Programme Génie Mécanique) offered by the Département Génie Électrique et Mécanique. The program aims to prepare students for leadership roles through a curriculum emphasizing core engineering competencies, including problem-solving, design, communication, and teamwork. The program requires 148 mandatory, 28 closed elective, and 4 open elective credits, covering fundamental subjects, specialized engineering topics, and practical experience through internships and a final year project. The curriculum is structured across five semesters, with specific courses and credit hours outlined, culminating in a final project.",
    "metadata": {
      "Header 1": "Département Génie Électrique et Mécanique",
      "Header 2": "Programme Génie Mécanique",
      "chunk_index": 35
    }
  },
{
  "page_content": "This section contains detailed course descriptions offered by the Département Génie Électrique et Mécanique. It covers core subjects in electrical, mechanical, and computer engineering, including circuit theory, electronics, electromagnetism, mechanics, control systems, programming, and embedded systems. Each course typically includes its code, credit value, main topics, and prerequisites. If you're searching for what is taught in a specific course or its requirements, the information is likely found here.It has course descriptions for each course including number of credits and prerequistes.",
  "metadata": {
    "Header 1": "Département Génie Électrique et Mécanique",
    "Header 2": "Description des Cours",
    "chunk_index": 36
  }
},
  
  {
    "page_content": "The document outlines the faculty of the Civil and Environmental Engineering Department, listing Professors, Associate Professors, Maîtres de Conférences, and a group of Chargés de Cours.",
    "metadata": {
      "Header 1": "Département Génie Civil et Environnement",
      "Header 2": "Corps Professoral",
      "chunk_index": 37
    }
  },
  {
    "page_content": "The Génie Civil et Environnement department trains high-level engineers skilled in designing and constructing projects across civil engineering, building, and environmental fields, emphasizing a multidisciplinary approach to project management.",
    "metadata": {
      "Header 1": "Département Génie Civil et Environnement",
      "Header 2": "Objectifs",
      "chunk_index": 38
    }
  },
  {
    "page_content": "Graduates of the Civil Engineering and Environment Department are prepared for diverse careers in civil engineering and construction, including project management, design, and research, across various sectors.",
    "metadata": {
      "Header 1": "Département Génie Civil et Environnement",
      "Header 2": "Débouchés",
      "chunk_index": 39
    }
  },
{
  "page_content": "This section includes: course plan,credit distribution,objectives,courses types and course distributions.This section outlines the academic program structure and course descriptions of the Département Génie Civil et Environnement. It details the 180 ECTS engineering curriculum students pursue after completing the preparatory cycle. The program offers three specialization tracks: Bâtiments et ingénierie de l’entreprise, Eau et environnement, and Travaux publics et transport. Educational objectives include developing students’ ethical, collaborative, and technical competencies for real-world civil engineering challenges. The program is structured across six semesters, incorporating core courses, specialization options, general culture subjects, language requirements, and practical projects such as architecture design, building planning, and a final capstone project. The curriculum also integrates professional internships and diverse engineering software tools. The second part includes detailed course descriptions (Descriptives des Cours), listing course titles, credit values, objectives, and prerequisites, covering subjects such as acoustics, urban planning, structural analysis, water distribution, project design, and technical English.",
  "metadata": {
    "Header 1": "Département Génie Civil et Environnement",
    "Header 2": "Programmes et Formations",
    "chunk_index": 40
  }
},
{
  "page_content": "This section lists the faculty members of the Département Génie Chimique et Pétrochimique. It includes associate professors such as Rafic Faddoul and Wadih Skaff, and maîtres de conférences like Marina Daccache, Farah Homsi, Jihane Rahbani, and Hiba Rajha. Additional teaching staff includes instructors from other faculties at USJ, such as Maher Abboud, Joseph Bejjani, Roger Lteif, and Dominique Salameh. A number of lecturers (chargés de cours) are also part of the department, including Ortanse Attarian Jabre, Jean Claude Assaf, Khattar Assaf, and others. This diverse faculty supports the department's academic and research missions in chemical and petrochemical engineering.",
  "metadata": {
    "Header 1": "Département Génie Chimique et Pétrochimique",
    "Header 2": "Corps Professoral",
    "chunk_index": 41
  }
},

  {
    "page_content": "The Department of Chemical and Petrochemical Engineering aims to train highly skilled engineers capable of innovation, critical thinking, and managing complex systems to address global challenges.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Objectifs",
      "chunk_index": 42
    }
  },
  {
    "page_content": "Graduates of the Génie Chimique et Pétrochimique department find careers in diverse industries like chemistry, energy, and pharmaceuticals. They can work in roles such as research, engineering, management, sales, consulting, and teaching.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Débouchés",
      "chunk_index": 43
    }
  },
  {
    "page_content": "The Chemical and Petrochemical Engineering program aims to prepare students to solve engineering problems, contribute to sustainable development, adapt to industry changes, and become ethical leaders.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Objectifs éducatifs du programme",
      "chunk_index": 44
    }
  },
  {
    "page_content": "This document outlines the core competencies students in the Chemical and Petrochemical Engineering Department are expected to master, including problem-solving, design, communication, ethics, teamwork, experimentation, and lifelong learning.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Compétences",
      "chunk_index": 45
    }
  },
  {
    "page_content": "It includes the course type division and credit distribution.The Chemical and Petrochemical Engineering program requires 184 credits, covering core areas like chemistry, math, process engineering, and petrochemistry. Key components include mandatory courses, electives (including Arabic language), internships, and projects. The curriculum emphasizes process engineering principles, mathematical modeling, and petrochemical applications. Students complete internships and a final year project involving industrial unit design, economic evaluation, and safety assessments, culminating in a report and presentations.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Exigences du programme",
      "chunk_index": 46
    }
  },
  {
    "page_content": "This document outlines the proposed four-semester curriculum for the Chemical and Petrochemical Engineering Department, detailing course content and credit hours for each semester. It also describes the course structure for semesters 4, 5, and 6, with a focus on core chemical engineering principles, elective courses, and a final project.",
    "metadata": {
      "Header 1": "Département Génie Chimique et Pétrochimique",
      "Header 2": "Plan Proposé",
      "chunk_index": 47
    }
  },
{
"page_content": "This section provides detailed descriptions of the courses offered by the Département Génie Chimique et Pétrochimique. It includes course titles, credit hours, learning objectives, and prerequisites for subjects covering topics like organic and inorganic chemistry, fluid dynamics, thermodynamics, and practical lab work. These course outlines are intended to guide students through the academic requirements and expectations within the department’s chemical and petrochemical engineering curriculum.It has course descriptions for each course including number of credits and prerequistes.",
"metadata": {
  "Header 1": "Département Génie Chimique et Pétrochimique",
  "Header 2": "Descriptives des Cours",
  "chunk_index": 48
}
},
  {
    "page_content": "The Department of Doctoral Studies aims to enhance master's students' knowledge and introduce them to research, while guiding doctoral candidates in conducting research for their dissertations.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Objectifs",
      "chunk_index": 49
    }
  },
  {
    "page_content": "The Department of Doctoral Studies offers doctoral programs (PhD) in Civil, Electrical, and Computer Engineering, along with Master's programs in fields like Data Science, AI, Renewable Energies, and more.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Programmes et formations",
      "chunk_index": 50
    }
  },
  {
    "page_content": "This document details the Master's in Data Sciences program at Saint-Joseph University of Beirut, designed to meet the growing demand for data scientists. The two-year, 120-credit program, validated by École Polytechnique de Paris, covers core data science topics like cloud computing, machine learning, data visualization, and enterprise data management. It includes a mandatory internship and culminates in a thesis. The curriculum encompasses courses in programming, statistics, database management, and specialized areas like web mining and social big data analysis, preparing graduates for careers in data analysis and decision-making.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master en Data Sciences",
      "chunk_index": 51
    }
  },
  {
    "page_content": "This document details a two-year Master's program in Artificial Intelligence, designed to equip students with the skills to develop and implement AI solutions across various industries. The curriculum covers foundational topics in programming, mathematics, and AI, progressing to advanced areas like machine learning, data science, and specialized AI applications (e.g., cybersecurity, Fintech, computer vision, NLP). The program includes practical experience through internships or research theses, and culminates in a final semester dedicated to either. The program emphasizes both theoretical knowledge and practical skills, preparing graduates for careers as AI specialists. The curriculum also includes courses on ethics, legal considerations, and essential mathematical and statistical foundations for AI and machine learning.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master in Artificial Intelligence",
      "chunk_index": 52
    }
  },
  {
    "page_content": "This document details a Master's program in Renewable Energy offered by the Département des Etudes Doctorales, focusing on training engineers and researchers to address the growing demand in the field. The program, a collaborative effort between Lebanese and international universities, covers a broad curriculum including renewable energy sources (solar, wind, hydro, biomass), energy storage, smart grids, sustainable building, and project evaluation. The program culminates in a research internship and thesis. Specific courses cover topics like bioenergy, wind energy, thermal system modeling, and distributed generation systems, with no prerequisites required.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master en Energies Renouvelables",
      "chunk_index": 53
    }
  },
{
  "page_content": "This document presents the Master's program in Electrical Engineering at USJ. It highlights the growing importance of electrical energy in modern industry and outlines how recent technological advances—such as new electrotechnical materials and power semiconductors—impact the field. The program aims to prepare students for research, teaching, and high-level roles in both industry and public administration. The 120-credit program is spread over four semesters (MR1–MR4) and includes theoretical and practical coursework, seminars, industry visits, and a final research internship culminating in a public thesis defense. Courses span areas such as advanced power electronics, motor control, electrical machines, microprocessor systems, digital control, energy storage, and electrical network analysis. The program emphasizes MATLAB/Simulink simulations, FPGA/VHDL architectures, and converter modeling. Students also undertake mini-projects in the first two semesters and complete a 30-credit research thesis in the final semester.",
  "metadata": {
    "Header 1": "Département des Études Doctorales",
    "Header 2": "Master en Génie Électrique",
    "chunk_index": 142
  }
},
  {
    "page_content": "The **Master en Management de la Sécurité Routière**, offered by the Département des Etudes Doctorales, aims to train road safety professionals to lead effective initiatives and eliminate road insecurity. The program, open to international students with a 4-year degree, covers a two-semester, 60-credit curriculum. It includes core courses on topics like intelligent transportation systems, vehicle safety, road design, user behavior, and accident management; a practical internship; and a research thesis. Graduates will gain expertise in data analysis, problem-solving, and communication, enabling them to excel in public, private, and social sector roles related to road safety.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master en Management de la Sécurité Routière",
      "chunk_index": 55
    }
  },
  {
    "page_content": "This document details the curriculum for a Master's program in Oil and Gas Exploration, Production & Management, offered by ESIB in Lebanon. The program, designed to meet the growing demand for oil and gas professionals, covers both upstream (reservoir engineering) and downstream (economics and management) aspects. The curriculum includes courses on petroleum economics, financial markets, legal and fiscal aspects, and technical subjects like fluid mechanics, geology, and reservoir engineering. It also encompasses practical training, projects, and a final report. The program emphasizes the application of theoretical knowledge through real-world scenarios and aims to equip graduates with the skills needed to succeed in the Lebanese and international oil and gas industries. The document also outlines specific courses within the program, including those related to renewable energy, advanced mechanics, applied statistics, and various aspects of petroleum operations.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master Oil and Gas: Exploration, Production & Management",
      "chunk_index": 56
    }
  },
  {
    "page_content": "This document details the **Master Sciences de l'Eau** program at Université Saint-Joseph de Beyrouth, designed to address critical water resource challenges, particularly in Lebanon. The 2-year program (120 credits) trains specialists through theoretical and practical courses, research, and a thesis. The curriculum covers foundational topics like hydraulics and hydrology, specialized areas like biogeochemistry and water management, and practical skills in data acquisition and wastewater treatment. Courses include spatial and temporal series analysis, finite element methods, and fluid mechanics, with a strong emphasis on research and practical application. The program aims to foster expertise in water resource management, addressing issues of scarcity, quality, and sustainable use.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master Sciences de l’Eau",
      "chunk_index": 57
    }
  },
  {
    "page_content": "This document details the Master's program in Structures and Soil Mechanics at Saint-Joseph University of Beirut, a 2-year, 120-credit program designed to train civil engineers for research and careers in the field. The program covers a wide range of topics including structural analysis, material behavior, geotechnics, and seismic design, culminating in a research internship and thesis. The curriculum includes courses on advanced structural calculations, material behavior, soil dynamics, and fluid mechanics, with a focus on practical application and international collaboration. The program emphasizes the importance of civil engineering in socio-economic development and the role of technology in advancing the field.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master Structure et Mécanique des Sols",
      "chunk_index": 58
    }
  },
  {
    "page_content": "This document describes the Master Télécommunications, Réseaux et Sécurité program, a two-year, 60-credit program offering specializations in Networks and Cybersecurity Engineering.  The program, a collaboration between Lebanese, French, and Canadian universities, trains engineers and researchers in telecommunications and security.  It includes theoretical courses, a mandatory internship (with a thesis and defense), and covers topics like network architectures, cryptography, cybercrime, network planning, and various network and software security aspects.  Specific courses delve into areas like network modeling, programming, security, and advanced radio techniques. All courses have no prerequisites.",
    "metadata": {
      "Header 1": "Département des Etudes Doctorales",
      "Header 2": "Master Télécommunications, Réseaux et Sécurité",
      "chunk_index": 59
    }
  },
  {
    "page_content": "This document details the personnel of CINET (NUD), including permanent researchers, the unit head, and affiliated doctoral students.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Membres",
      "chunk_index": 60
    }
  },
  {
    "page_content": "CINET's mission, encompassing scientific, academic, and industrial aspects, focuses on research, education, and industry collaboration within the fields of electrical industries and telecommunications.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Mission",
      "chunk_index": 61
    }
  },
  {
    "page_content": "CINET (NUD) houses laboratories for Physics, Telecommunications, Electronics, High Current-Machine, and Mechanics, along with offices, a meeting room, a PhD student room, and a repair workshop.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Laboratoires et locaux",
      "chunk_index": 62
    }
  },
  {
    "page_content": "CINET (Centre des Industries Électriques et des Télécommunications) is open Monday-Friday from 8:00 AM to 5:30 PM, and sometimes until 8:00 PM.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Horaire d’ouverture",
      "chunk_index": 63
    }
  },
  {
    "page_content": "CINET (Centre des Industries Électriques et des Télécommunications) offers services in academic (lab management, student support), research (doctoral support, research strategy), and professional areas (industry connections, training, consulting) related to electrical engineering, electronics, and electromagnetic pollution. They also provide maintenance support to other engineering labs.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Services",
      "chunk_index": 64
    }
  },
  {
    "page_content": "CINET (NUD) researches in electrical and telecommunications, focusing on energy efficiency, renewable energy integration, power quality, antenna design, electromagnetic field analysis, and hybrid magnetic materials for biomedical and environmental uses.",
    "metadata": {
      "Header 1": "CINET : Centre des Industries Électriques et des Télécommunications (NUD)",
      "Header 2": "Thématiques de recherche",
      "chunk_index": 65
    }
  },
  {
    "page_content": "This document lists the members of CLERC (Lebanese Centre for Construction Studies and Research), including the Secretary (Rana El Khoury), permanent researchers, technical staff, and doctoral students.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Membres",
      "chunk_index": 66
    }
  },
  {
    "page_content": "CLERC is a Lebanese center providing scientific and technical expertise to the civil engineering sector. Its mission includes technical assistance, research, testing construction materials, and training, with key areas of focus on research, standards, and quality projects.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Mission",
      "chunk_index": 67
    }
  },
  {
    "page_content": "CLERC's document outlines the space allocation within the CST-ESIB building for its laboratories and facilities. The **Niveau Supérieur** features a 100 m² area with a lab and two offices, while the **Niveau Inférieur** offers a 490 m² space including two labs, storage, offices, and a cold room.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Laboratoires et locaux",
      "chunk_index": 68
    }
  },
  {
    "page_content": "CLERC, the Lebanese Centre for Construction Studies and Research, is open Monday to Friday, 8:00 AM to 4:00 PM.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Horaire d’ouverture",
      "chunk_index": 69
    }
  },
  {
    "page_content": "CLERC, the Lebanese Centre for Construction Studies and Research, offers research services, technical assistance (diagnostics, testing, design support), and contributes to technical advice and standards development. CLERC operates under ISO 9001 quality standards.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Services",
      "chunk_index": 70
    }
  },
  {
    "page_content": "CLERC's research focuses on civil engineering and infrastructure, with three primary axes: structural modeling/calculation, material mechanics, and structural health monitoring.  Further research areas include composite materials, decision support tools, road infrastructure, transportation/safety, earthworks, and infrastructure maintenance.  Specific areas of focus include road safety, soil behavior under various loads, and soil contamination/geology.",
    "metadata": {
      "Header 1": "CLERC : Centre Libanais d’Etudes et de Recherches de la Construction",
      "Header 2": "Thématiques de recherche",
      "chunk_index": 71
    }
  },
  {
    "page_content": "This document lists the members of CIMTI (NUD), including the assistant, permanent researchers, and doctoral students.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Membres",
      "chunk_index": 72
    }
  },
  {
    "page_content": "The CIMTI's mission, encompassing scientific research, academic support, and industrial collaboration, focuses on communication and information technologies. It conducts research, supports engineering education, and provides services to industry.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Mission du CIMTI",
      "chunk_index": 73
    }
  },
  {
    "page_content": "CIMTI (NUD) manages computer labs, a network lab, and a high-performance computing lab, along with computing servers, offices, and meeting rooms.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Laboratoires et locaux",
      "chunk_index": 74
    }
  },
  {
    "page_content": "CIMTI (NUD) is open Monday-Friday from 8:00 AM to 7:30 PM.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Horaire d’ouverture",
      "chunk_index": 75
    }
  },
  {
    "page_content": "CIMTI (NUD) provides services in three areas: academic (computer labs, student support), research (doctoral student support, research management), and professional (company collaborations, training, consulting).",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Services",
      "chunk_index": 76
    }
  },
  {
    "page_content": "CIMTI (NUD) conducts research in mobile networks, IoT, cybersecurity, data integration, machine learning/AI, and mixed-signal integrated circuit design.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Thématiques de recherche",
      "chunk_index": 77
    }
  },
  {
    "page_content": "CIMTI at NUD is conducting research projects including: **JUPITER**, a low-power radio jamming unit; **Skills2Share**, a mobile app for hearing-impaired youth; and **Low-Power Long-Range IoT in Lebanon**, exploring smart agriculture. Two projects are detailed: one deploying a LoRa-based LPWAN for microclimate monitoring in Lebanese vineyards, and another using deep learning with LIDAR for real-time road asset detection in self-driving cars.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Projets de recherche en cours",
      "chunk_index": 78
    }
  },
  {
    "page_content": "CIMTI (NUD) actively collaborates with numerous local, regional, and international partners, including universities, research institutions, and organizations like CNRS Liban, AUB, and CERN.",
    "metadata": {
      "Header 1": "CIMTI : Centre d'Informatique, de Modélisation et de Technologies de l'Information (NUD)",
      "Header 2": "Collaborations et partenariats",
      "chunk_index": 79
    }
  }
]